; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v3 - type_2 ?v8 - type_1)
 	      (pred_4 ?v2 - object ?v8 - type_1)
	      (pred_1 ?v3 - type_2 ?v7 - type_3)
	      (pred_3 ?v3 - type_2 ?v2 - object ?v7 - type_3))

   (:action op_1
       :parameters  (?v3 - type_2 ?v6 ?v1 - type_1)
       :precondition (and  (pred_2 ?v3 ?v6))
       :effect (and  (pred_2 ?v3 ?v1)
		     (not (pred_2 ?v3 ?v6))))

   (:action op_3
       :parameters (?v3 - type_2 ?v4 - object ?v5 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v4 ?v5) (pred_2 ?v3 ?v5) (pred_1 ?v3 ?v7))
       :effect (and (pred_3 ?v3 ?v4 ?v7)
		    (not (pred_4 ?v4 ?v5)) 
		    (not (pred_1 ?v3 ?v7))))

   (:action op_2
       :parameters (?v3 - type_2 ?v4 - object ?v5 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v4 ?v7) (pred_2 ?v3 ?v5))
       :effect (and (pred_4 ?v4 ?v5)
		    (pred_1 ?v3 ?v7)
		    (not (pred_3 ?v3 ?v4 ?v7)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_07 - type_2
obj_08 obj_04 - type_3
obj_05 obj_09 obj_01 - type_1
obj_03 obj_06 obj_02 - object)
(:init
(pred_2 obj_07 obj_01)
(pred_1 obj_07 obj_08)
(pred_1 obj_07 obj_04)
(pred_4 obj_03 obj_01)
(pred_4 obj_06 obj_05)
(pred_4 obj_02 obj_01)
)
(:goal
(and
(pred_4 obj_03 obj_05)
(pred_4 obj_06 obj_01)
(pred_4 obj_02 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_07 ?b obj_04))))
)
)

; plan
1. (op_3 obj_07 obj_03 obj_01 obj_08)
   deleted: (pred_4 obj_03 obj_01) (pred_1 obj_07 obj_08)
   added: (pred_3 obj_07 obj_03 obj_08)
   goals met: 1 of 3
2. (op_1 obj_07 obj_01 obj_05)
   deleted: (pred_2 obj_07 obj_01)
   added: (pred_2 obj_07 obj_05)
   goals met: 1 of 3
3. (op_2 obj_07 obj_03 obj_05 obj_08)
   deleted: (pred_3 obj_07 obj_03 obj_08)
   added: (pred_4 obj_03 obj_05) (pred_1 obj_07 obj_08)
   goals met: 2 of 3
4. (op_3 obj_07 obj_06 obj_05 obj_08)
   deleted: (pred_4 obj_06 obj_05) (pred_1 obj_07 obj_08)
   added: (pred_3 obj_07 obj_06 obj_08)
   goals met: 2 of 3
5. (op_1 obj_07 obj_05 obj_01)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_01)
   goals met: 2 of 3
6. (op_2 obj_07 obj_06 obj_01 obj_08)
   deleted: (pred_3 obj_07 obj_06 obj_08)
   added: (pred_4 obj_06 obj_01) (pred_1 obj_07 obj_08)
   goals met: 3 of 3
